---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxMemberData.Text
source: html/e458867c-9e81-c5fb-0615-119c5852ccb6.htm
---
# Autodesk.Revit.UI.ComboBoxMemberData.Text Property

The user-visible text of the ComboBoxMember.

## Syntax (C#)
```csharp
public string Text { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when setting the value to Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when setting the value to an empty string,
or when the value contains invalid characters.